app/controllers/admin/dealers_controller.rb

SELECT COUNT(*) FROM "users" WHERE "users"."is_approved" = $1  [["is_approved", false]]
SELECT "users".* FROM "users" WHERE "users"."is_approved" = $1 LIMIT $2  [["is_approved", false], ["LIMIT", 11]]
---
  def index
    @users = User.where(is_approved: false).page params[:page]

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
UPDATE "users" SET "reset_password_token" = $1, "reset_password_sent_at" = $2, "updated_at" = $3, "is_approved" = $4 WHERE "users"."id" = $5  [["reset_password_token", "[FILTERED]"], ["reset_password_sent_at", "[FILTERED]"], ["updated_at", "2024-01-18 13:47:54.413887"], ["is_approved", true], ["id", 48]]
---
  def approved
    user = User.find_by(id: params[:id])
    if user.present?
      raw, hashed = Devise.token_generator.generate(User, :reset_password_token)
      user.reset_password_token = hashed
      user.reset_password_sent_at = Time.now
      user.is_approved = true
      user.save