app/services/inventory_images/process_images.rb

SELECT "inventories"."id", "inventories"."image_urls" FROM "inventories" WHERE "inventories"."images_processed" = $1 AND "inventories"."image_urls" IS NOT NULL  [["images_processed", false]]
---
    def formatted_data
      image_urls = Inventory.where(images_processed: false).where.not(image_urls: nil).pluck(:id, :image_urls).to_h