app/helpers/inventories_helper.rb

  def inventory_company_options
    Inventory.group(:make).where.not(make: nil).select(:make).map do |m|
---
SELECT "inventories"."make" FROM "inventories" WHERE "inventories"."make" IS NOT NULL GROUP BY "inventories"."make"