app/controllers/application_controller.rb

SELECT 1 AS one FROM "inventories" WHERE "inventories"."user_id" = $1 LIMIT $2  [["user_id", 51], ["LIMIT", 1]]
---
  def set_default_mode
    # Check if the user is signed in and if the mode is not already set
    if user_signed_in? && session[:mode].blank?
      # Set the default mode based on your logic
      session[:mode] = current_user.inventories.empty? ? 'buyer' : 'seller'