app/controllers/dashboard_controller.rb

  def index
    @inventories = Inventory.all
---
SELECT "inventories".* FROM "inventories" ORDER BY "inventories"."id" DESC LIMIT $1  [["LIMIT", 1]]