app/controllers/inventories_controller.rb

    def set_inventory
      @inventory = Inventory.find_by_id(params[:id])
      redirect_to root_path unless @inventory.present?
---
SELECT 1 AS one FROM "inventories" LIMIT $1  [["LIMIT", 1]]