app/controllers/inventories_controller.rb

INSERT INTO "inventories" ("inventory_type", "stock", "vin", "year", "make", "model", "body", "trim", "doors", "exterior_color", "interior_color", "engine_cylinders", "engine_displacement", "transmission", "miles", "price", "msrp", "book_value", "invoice", "certified", "date_in_stock", "description", "options", "categorized_options", "comments", "style_description", "ext_color_generic", "ext_color_code", "ext_color_hex_code", "int_color_generic", "int_color_code", "int_color_hex_code", "int_upholstery", "engine_block_type", "engine_aspiration_type", "engine_description", "transmission_speed", "transmission_description", "drivetrain", "fuel_type", "city_mpg", "highway_mpg", "epa_classifications", "wheelbase_code", "internet_price", "misc_price1", "misc_price2", "misc_price3", "factory_codes", "market_class", "passenger_capacity", "engine_displacement_cubic_inches", "image_list", "user_id", "transmission_gear", "created_at", "updated_at", "image_urls", "images_processed", "listed", "state") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50, $51, $52, $53, $54, $55, $56, $57, $58, $59, $60, $61) RETURNING "id"
---
  def attach_csv

    uploaded_file = params[:csv_file]
    if uploaded_file && uploaded_file.content_type == 'text/csv'
      csv_data = CSV.read(uploaded_file.path, headers: true)
      csv_data.each do |row|
        inventory = Inventory.new
        csv_mapper = inventory.csv_upload_mapper
        csv_mapper.each do |key, value|
      puts key
          inventory.send("#{value}=", row[key]) unless value.include?("image_list")
        end
        if row['ImageList'].present?
          inventory.image_urls = row['ImageList'].split(',')
        end
        inventory.user = current_user
        inventory.save

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_inventory
      @inventory = Inventory.find(params[:id])